;Place localized text in this file
[AssaultTrooperT1 X2CharacterTemplate]
strCharacterName="ADVENT Assault Trooper"
strAcquiredText="Assault Troopers are armored infantry armed with shotguns"

[AssaultTrooperT2 X2CharacterTemplate]
strCharacterName="ADVENT Advanced Assault Trooper"
strAcquiredText="Assault Troopers are armored infantry armed with shotguns"

[AssaultTrooperT3 X2CharacterTemplate]
strCharacterName="ADVENT Elite Assault Trooper"
strAcquiredText="Assault Troopers are armored infantry armed with shotguns"

[AssaultTrooperCaptn X2CharacterTemplate]
strCharacterName="ADVENT Assault Trooper Captain"
strAcquiredText="Assault Trooper Captains are armed with long range shotguns"

[T1AssaultShotgun X2WeaponTemplate]
FriendlyName="ADVENT Assault Shotgun"
FriendlyNamePlural="ADVENT Assault Shotguns"
BriefSummary="Advent's standardized infantry shotgun"
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/>"

[T2AssaultShotgun X2WeaponTemplate]
FriendlyName="ADVENT Assault Shotgun"
FriendlyNamePlural="ADVENT Assault Shotguns"
BriefSummary="Advent's standardized infantry shotgun"
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/>"

[T3AssaultShotgun X2WeaponTemplate]
FriendlyName="ADVENT Assault Shotgun"
FriendlyNamePlural="ADVENT Assault Shotguns"
BriefSummary="Advent's standardized assault shotgun"
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/>"

[CptnAssaultShotgun X2WeaponTemplate]
FriendlyName="ADVENT Assault Captain Shotgun"
FriendlyNamePlural="ADVENT Assault Captain Shotguns"
BriefSummary="The Assault Captain's personalized Shotgun"
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/>"

[MagGrenade X2AbilityTemplate]
LocFriendlyName="Fire mag grenade"
LocLongDescription="Advent's standard magnetic grenade"
LocHelpText="Target a small area with a magnetic grenade."

[LaserGrenade X2AbilityTemplate]
LocFriendlyName="Fire laser grenade"
LocLongDescription="Laser grenades fire powerful armor piercing lasers in all directions"
LocHelpText="Target a small area with a laser grenade."

[RadGrenade X2AbilityTemplate]
LocFriendlyName="Fire radiation grenade"
LocLongDescription="Radiation grenades can afflict a multitude of status effects"
LocHelpText="Target a large area with a radiation grenade."

[LeadVestBonus X2AbilityTemplate]
LocFriendlyName="Lead lined vest protection"
LocLongDescription="Lead vests protect against radiation, and grant a bonus to HP and Armor"
LocHelpText="Protects against radiation."

[LeadHazmatVestBonus X2AbilityTemplate]
LocFriendlyName="Lead lined hazmat vest protection"
LocLongDescription="Lead lined hazmat vests protect against radiation, poison, fire, acid, and grant a bonus to HP and Armor"
LocHelpText="Protects against radiation, poison, fire, and acid."

[LostRegenerate X2AbilityTemplate]
LocFriendlyName="Lost regeneration"
LocLongDescription="Losts under the effect of a radiation regenerate wounds at incredible speed"
LocHelpText="Regenerates 8hp per turn."

[LostRadBuffs X2AbilityTemplate]
LocFriendlyName="Lost radiation super charge"
LocLongDescription="Lost under the effect of a radiation gain increased mobility, crit chance, and aim"
LocHelpText="Increased mobility, aim, and crit chance."

[RadRounds X2AbilityTemplate]
LocFriendlyName="Radiation Ammo"
LocLongDescription="Radiation applies a variety of status effects"
LocHelpText="Radiation Ammo applies radiation status effects."

[RadImmunity X2AbilityTemplate]
LocFriendlyName="Radiation Immunity"
LocLongDescription="This unit is immune to radiation damage"
LocHelpText="Immune to radiation."

[LeadVest X2EquipmentTemplate]
FriendlyName="Lead Lined Vest"
FriendlyNamePlural="Lead Lined Vests"
BriefSummary="These plated vests are lined with lead, providing protection against radiation in addition to a health boost, and additional armor protection from enemy attacks."
TacticalText="<Bullet/> Increases soldier health.\n<Bullet/> Provides armor.\n<Bullet/> Protects from radiation"

[LeadHazmatVest X2EquipmentTemplate]
FriendlyName="Lead Lined Hazmat Vest"
FriendlyNamePlural="Lead Lined Hazmat Vests"
BriefSummary="These Hazmat vests are lined with lead, providing protection against radiation in addition to fire, poison, and acid protection."
TacticalText="<Bullet/> Increases soldier health.\n<Bullet/> Provides armor.\n<Bullet/> Protects from radiation, fire, poison, and acid"

[AssaultGLMag X2WeaponTemplate]
FriendlyName="ADVENT Assault Grenade Launcher"
FriendlyNamePlural="ADVENT Assault Grenade Launchers"
BriefSummary="Advent's lightweight grenade launcher, loaded with magnetic grenades"

[AssaultGLLaser X2WeaponTemplate]
FriendlyName="ADVENT Assault Grenade Launcher"
FriendlyNamePlural="ADVENT Assault Grenade Launchers"
BriefSummary="Advent's lightweight grenade launcher, loaded with laser grenades"

[AssaultGLRad X2WeaponTemplate]
FriendlyName="ADVENT Assault Grenade Launcher"
FriendlyNamePlural="ADVENT Assault Grenade Launchers"
BriefSummary="Advent's lightweight grenade launcher, loaded with radiation grenades"

[AssaultGLCptn X2WeaponTemplate]
FriendlyName="ADVENT Assault Grenade Launcher"
FriendlyNamePlural="ADVENT Assault Grenade Launchers"
BriefSummary="Assault Captain lightweight grenade launcher, loaded with radiation grenades"

[RadiationRounds X2AmmoTemplate]
FriendlyName="Radiation Rounds"
FriendlyNamePlural="Radiation Rounds"
BriefSummary="Irradiated rounds capable of inflicting radiation effects on targets"
TacticalText="<Bullet/> These rounds do extra damage and have a chance to inflict irradiation, radiation burn, and boiling blood.<br>"

[RadGrenade X2GrenadeTemplate]
FriendlyName="Radiation Grenade"
FriendlyNamePlural="Radiation Grenades"
BriefSummary="Radiation grenades release high doses of radiation upon impact, targets within the blast radius can be irradiated, set ablaze with unnatural flames, or even have the blood within their bodies boil."
TacticalText="<Bullet/> Radiation grenades will damage all units in the blast radius, and can apply a variety of radiation effects to any units vulnerable to radiation."
ThrownAbilityName="Throw Radiation Grenade"
ThrownAbilityHelpText="Damages units in the target area, and has a chance to apply multiple radiation effects on units caught in the blast."
LaunchedAbilityname="Launch Radiation Grenade"
LaunchedAbilityHelpText="Damages units in the target area, and has a chance to apply multiple radiation effects on units caught in the blast."

[LaserGrenade X2GrenadeTemplate]
FriendlyName="Laser Grenade"
FriendlyNamePlural="Laser Grenades"
BriefSummary="Laser grenades deal high damage and penetrate even the thickest armor."
TacticalText="<Bullet/> Laser grenades will damage all units in the blast radius, and will penetrate the thickest armor."
ThrownAbilityName="Throw Laser Grenade"
ThrownAbilityHelpText="Penetrates armor and damages units in the target area."
LaunchedAbilityname="Launch Laser Grenade"
LaunchedAbilityHelpText="Penetrates armor and damages units in the target area."

[MagGrenade X2GrenadeTemplate]
FriendlyName="Magnetic Grenade"
FriendlyNamePlural="Magnetic Grenades"
BriefSummary="A concussive grenade augmented by magnetic technology, the magnetic grenade can knockback enemies."
TacticalText="<Bullet/> Magnetic grenades will damage all units in the blast radius."
ThrownAbilityName="Throw Magnetic Grenade"
ThrownAbilityHelpText="Damages units in the target area."
LaunchedAbilityname="Launch Magnetic Grenade"
LaunchedAbilityHelpText="Damages units in the target area."

[CorpseT1AssaultTrooper X2ItemTemplate]
FriendlyName="Assault Trooper Corpse"
FriendlyNamePlural="Assault Trooper Corpses"
BriefSummary="Despite the heavier armor, the bodies of ADVENT Assault Troopers are indistinguishable from regular troopers save for slightly thicker muscles."

[CorpseT2AssaultTrooper X2ItemTemplate]
FriendlyName="Advanced Assault Trooper Corpse"
FriendlyNamePlural="Advanced Assault Trooper Corpses"
BriefSummary="These advanced assault troops sport even heavier armor than their standard counterparts."

[CorpseT3AssaultTrooper X2ItemTemplate]
FriendlyName="Elite Assault Trooper Corpse"
FriendlyNamePlural="Elite Assault Trooper Corpses"
BriefSummary="Elite assault troopers wear much heavier, and more specialized armor."

[CorpseCaptnAssaultTrooper X2ItemTemplate]
FriendlyName="Assault Trooper Captain Corpse"
FriendlyNamePlural="Assault Trooper Captain Corpses"
BriefSummary="Assault trooper captains wear excessively heavy armor, causing these troopers to develop much thicker muscles."

[AutopsyT1AssaultTrooper X2TechTemplate]
DisplayName="ADVENT Assault Trooper Autopsy"
Summary="While similar to the standard Advent trooper on the surface, perhaps closer inspection could reveal otherwise."
CodeName="Othisi"
LongDescription="Despite my suspicions that underneath their similar exterior these assault troopers would be different from the standard Advent Trooper, it appears that they are the same creature. The assault trooper has thicker musculature than the standard trooper but this can be attributed to their equipment being heavier, and perhaps their training being more demanding. Other than that biological difference, the only differences are in their equipment, their armor is thicker, and heavier, and their weaponry is intended for close quarter combat. R. Tygan."
AlertString="ADVENT Assault Trooper"

[AutopsyT2AssaultTrooper X2TechTemplate]
DisplayName="ADVENT Advanced Assault Trooper Autopsy"
Summary="Once again this specimen appears identical to other standard Advent troops, with the differences being exclusive to their equipment."
CodeName="Impetus"
LongDescription="Like the standard assault trooper, this creature has thicker musculature than the standard trooper. However it appears that unlike the standard Assault Trooper, this one has their muscles enhanced further through the use of drugs, and has had even their bone structure tampered with geneticaly. While not to an excessive degree, this creature is without a doubt physically stronger and more resistant to trauma than the standard Assault Trooper. Once again their gear has also seen some upgrades, thicker plates and a heavier helmet designed to protect them in close quarter combat. R. Tygan."
AlertString="ADVENT Advanced Assault Trooper"

[AutopsyT3AssaultTrooper X2TechTemplate]
DisplayName="ADVENT Elite Assault Trooper Autopsy"
Summary="The evolution of the advanced assault trooper, unlike the previous specimens this one bears the hallmarks of extensive genetic tampering."
CodeName="Assailant"
LongDescription="Unlike the previous specimens, this one shows signs of rampant genetic tampering, the build of their muscles is now irregular, with their lower bodies showing much stronger, and springier muscles, designed to increase their speed. Meanwhile their upper body, while still muscular, has been improved with stronger bones, their ribcage, cranium, and spine in particular are much heavier than on the previous generations, their ribs are now so thick that they almost fuse together.\n\nMeanwhile their organs have also been tampered with, these creatures now possess a smaller secondary heart, and the size of their stomach and intestines has been reduced to make space for larger lungs. Finally, once again their gear has been upgraded with additional armor plates to defend their dominant arm and neck, which appears to now be the sole weak link in the upper body as their head is now protected by a larger more sophisticated helmet. R. Tygan."
AlertString="ADVENT Elite Assault Trooper"

[AutopsyCaptnAssaultTrooper X2TechTemplate]
DisplayName="ADVENT Assault Trooper Captain Autopsy"
Summary="The leaders of Advent assault troopers wear imposing heavy armor, less sophisticated than those of shieldbeaers and other specialized alien forces, but the thickness and flexibility of this armor more than makes up for it."
CodeName="Nasilstvo"
LongDescription="Inspecting this body I expected to find the same kind of genetic tampering as I found in the elite assault troopers, however to my surprise this creature appears to have gained most of its impressive physical attributes through natural means, perhaps this is the reason why this trooper commands the rest. While the large muscles on this trooper seem to have been built through natural means, this hybrid still shows signs of genetic tampering, once again the skeletal structure has been improved, but while the elite trooper had most of its augmentation done on the upper body, the captain shows signs of artificial bone manipulation in their entire body, almost every bone is much thicker and heavier than normal.\n\nThis genetic tampering is strangely blunt, and even negligent of the Elders as it would negatively impact other valuable attributes such as mobility, and dexterity, but it appears to have an almost imperceptible impact on this troopers performance, whether this is attributed to their impressive physical build, or something such as willpower is hard to say.\n\nFinally it is worth noting that the chip implanted in their brain is different from those of other assault troopers, causing this trooper to have a weaker connection to the advent network, perhaps showing that this creature has more freedom than most advent forces. R. Tygan."
AlertString="ADVENT Assault Trooper Captain"